const KEYS = {
  UNSHIFT:
      {
        EN:
              [
                ['`', '1', '2', '3', '4', '5', '6', '7', '8', '9', '0', '-', '=', 'backspace'],
                ['TAB', 'q', 'w', 'e', 'r', 't', 'y', 'u', 'i', 'o', 'p', '[', ']', '\\', 'Del'],
                ['CAPSLOCK', 'a', 's', 'd', 'f', 'g', 'h', 'j', 'k', 'l', ';', "'", 'ENTER'],
                ['LShift', 'z', 'x', 'c', 'v', 'b', 'n', 'm', ',', '.', '/', '▲', 'RShift'],
                ['LCtrl', 'WIN', 'LAlt', 'space', 'RAlt', '◄', '▼', '►', 'RCtrl'],
              ],
        RU:
              [
                ['ё', '1', '2', '3', '4', '5', '6', '7', '8', '9', '0', '-', '=', 'backspace'],
                ['TAB', 'й', 'ц', 'у', 'к', 'е', 'н', 'г', 'ш', 'щ', 'з', 'х', 'ъ', '\\', 'Del'],
                ['CAPSLOCK', 'ф', 'ы', 'в', 'а', 'п', 'р', 'о', 'л', 'д', 'ж', 'э', 'ENTER'],
                ['LShift', 'я', 'ч', 'с', 'м', 'и', 'т', 'ь', 'б', 'ю', '/', '▲', 'RShift'],
                ['LCtrl', 'WIN', 'LAlt', 'space', 'RAlt', '◄', '▼', '►', 'RCtrl'],
              ],
      },
  SHIFT:
      {
        EN:
              [
                ['~', '!', '@', '#', '$', '%', '^', '&', '*', '(', ')', '_', '+', 'backspace'],
                ['TAB', 'Q', 'W', 'E', 'R', 'T', 'Y', 'U', 'I', 'O', 'P', '{', '}', '|', 'Del'],
                ['CAPSLOCK', 'A', 'S', 'D', 'F', 'G', 'H', 'J', 'K', 'L', ':', '"', 'ENTER'],
                ['LShift', 'Z', 'X', 'C', 'V', 'B', 'N', 'M', '<', '>', '?', '▲', 'RShift'],
                ['LCtrl', 'WIN', 'LAlt', 'space', 'RAlt', '◄', '▼', '►', 'RCtrl'],
              ],
        RU:
              [
                ['Ё', '!', '"', '№', '%', ':', ',', '.', ';', '(', ')', '_', '+'],
                ['TAB', 'Й', 'Ц', 'У', 'К', 'Е', 'Н', 'Г', 'Ш', 'Щ', 'З', 'Х', 'Ъ', '/', 'Del'],
                ['CAPSLOCK', 'Ф', 'Ы', 'В', 'А', 'П', 'Р', 'О', 'Л', 'Д', 'Ж', 'Э', 'ENTER'],
                ['LShift', 'Я', 'С', 'С', 'М', 'И', 'Т', 'Ь', 'Б', 'Ю', '?', '▲', 'RShift'],
                ['LCtrl', 'WIN', 'Alt', 'space', 'RAlt', '◄', '▼', '►', 'RCtrl'],
              ],
      },
  CAPSLOCK_UNSHIFT:
      {
        EN:
              [
                ['`', '1', '2', '3', '4', '5', '6', '7', '8', '9', '0', '-', '=', 'backspace'],
                ['TAB', 'Q', 'W', 'E', 'R', 'T', 'Y', 'U', 'I', 'O', 'P', '[', ']', '\\', 'Del'],
                ['CAPSLOCK', 'A', 'S', 'D', 'F', 'G', 'H', 'J', 'K', 'L', ':', '"', 'ENTER'],
                ['LShift', 'Z', 'X', 'C', 'V', 'B', 'N', 'M', '<', '>', '?', '▲', 'RShift'],
                ['LCtrl', 'WIN', 'Alt', 'space', 'RAlt', '◄', '▼', '►', 'RCtrl'],
              ],
        RU:
              [
                ['Ё', '1', '2', '3', '4', '5', '6', '7', '8', '9', '0', '-', '=', 'backspace'],
                ['TAB', 'Й', 'Ц', 'У', 'К', 'Е', 'Н', 'Г', 'Ш', 'Щ', 'З', 'Х', 'Ъ', '\\', 'Del'],
                ['CAPSLOCK', 'Ф', 'Ы', 'В', 'А', 'П', 'Р', 'О', 'Л', 'Д', 'Ж', 'Э', 'ENTER'],
                ['LShift', 'Я', 'С', 'С', 'М', 'И', 'Т', 'Ь', 'Б', 'Ю', '?', '▲', 'RShift'],
                ['LCtrl', 'WIN', 'LAlt', 'space', 'RAlt', '◄', '▼', '►', 'RCtrl'],
              ],
      },
  CAPSLOCK_SHIFT:
      {
        EN:
              [
                ['`', '1', '2', '3', '4', '5', '6', '7', '8', '9', '0', '-', '=', 'backspace'],
                ['TAB', 'Q', 'W', 'E', 'R', 'T', 'Y', 'U', 'I', 'O', 'P', '[', ']', '\\', 'Del'],
                ['CAPSLOCK', 'A', 'S', 'D', 'F', 'G', 'H', 'J', 'K', 'L', ':', '"', 'ENTER'],
                ['LShift', 'Z', 'X', 'C', 'V', 'B', 'N', 'M', '<', '>', '?', '▲', 'RShift'],
                ['LCtrl', 'WIN', 'Alt', 'space', 'RAlt', '◄', '▼', '►', 'RCtrl'],
              ],
        RU:
              [
                ['Ё', '1', '2', '3', '4', '5', '6', '7', '8', '9', '0', '-', '=', 'backspace'],
                ['TAB', 'Й', 'Ц', 'У', 'К', 'Е', 'Н', 'Г', 'Ш', 'Щ', 'З', 'Х', 'Ъ', '\\', 'Del'],
                ['CAPSLOCK', 'Ф', 'Ы', 'В', 'А', 'П', 'Р', 'О', 'Л', 'Д', 'Ж', 'Э', 'ENTER'],
                ['LShift', 'Я', 'С', 'С', 'М', 'И', 'Т', 'Ь', 'Б', 'Ю', '?', '▲', 'RShift'],
                ['LCtrl', 'WIN', 'LAlt', 'space', 'RAlt', '◄', '▼', '►', 'RCtrl'],
              ],
      },
};

export default KEYS;
